In [1]:
import sys
# caution: path[0] is reserved for script path (or '' in REPL)
sys.path.insert(1, 'D:\\Sparta\\final_project\\data210-final-project\\Scripts')
import sqlalchemy as db
from sqlalchemy import create_engine, Table, Column, Integer, String, MetaData, Date, ForeignKey, Boolean
from sqlalchemy import text
from sqlalchemy_utils import database_exists, create_database
from dotenv import load_dotenv
import os
import pandas as pd
#load_dotenv()  # Load environment variables from .env file
#db_password = os.getenv("DB_PASSWORD")

In [2]:
engine = create_engine("mssql+pyodbc://admin:spartaglobal@sparta-global.cjxe5m4vhofo.eu-west-2.rds.amazonaws.com:1433/project?driver=ODBC+Driver+17+for+SQL+Server")

In [3]:
try:
    if database_exists(engine.url) == False:
        create_database(engine.url)
except:
    create_database(engine.url)

# drop all tables
metadata = db.MetaData()
metadata.reflect(bind=engine)
metadata.drop_all(bind=engine)

with engine.connect() as conn:
    metadata = MetaData()

    #define tables
    table_name = 'Recruiters'
    recruiters_table = Table (table_name, metadata,
                            Column('recruiter_id', Integer, primary_key=True, autoincrement=True),
                            Column('recruiter_name', String)
                            )

    table_name = 'Applicants'
    applicants_table = Table(table_name, metadata,
                        Column('applicant_id', String(50), primary_key=True),
                        Column('name', String),
                        Column('gender', String),
                        Column('dob', Date),
                        Column('email', String),
                        Column('phone_number', String),
                        Column('uni', String),
                        Column('degree', String),
                        Column('invited_date', Date),
                        Column('recruiter_id', Integer, ForeignKey('Recruiters.recruiter_id'))                  
                        )

    # table_name = 'Location'
    # location_table = Table (table_name, metadata,
    #                         Column('location_id', Integer, primary_key=True, autoincrement=True),
    #                         Column('applicant_id', String(50), ForeignKey('Applicants.applicant_id')),
    #                         Column('address', String),
    #                         Column('postcode', String),
    #                         Column('city', String)
    #                         )

    table_name = 'Academy_Locations'
    Academy_location_table = Table (table_name, metadata,
                        Column('academy_location_id', Integer, primary_key=True, autoincrement=True),
                        Column('location_name', String)
                        )

    table_name = 'Talent'
    talent_table = Table(table_name, metadata,
                                Column('talent_id', Integer, primary_key=True,autoincrement=True),
                                Column('json_key', Integer, unique=True, nullable=True),
                                Column('applicant_id', String(50), ForeignKey('Applicants.applicant_id'), unique=True),
                                Column('date', Date, nullable=True),
                                Column('self_development', Boolean),
                                Column('financial_support_self', Boolean),
                                Column('result', Integer),
                                Column('course_interest', String),
                                Column('psychometric_result', Integer),
                                Column('presentation_result', Integer),
                                Column('geo_flex', Boolean),
                                Column('academy_location_id', Integer, ForeignKey('Academy_Locations.academy_location_id'))
                                )

    table_name = 'Strengths'
    strengths_table = Table(table_name, metadata,
                        Column('strength_id', Integer, primary_key=True),
                        Column('strength', String(30), unique=True, nullable=False)
                        )

    table_name = 'Weaknesses'
    strengths_table = Table(table_name, metadata,
                        Column('weakness_id', Integer, primary_key=True),
                        Column('weakness', String(30), unique=True, nullable=False)
                        )

    table_name = 'Strengths_Junction'
    strengths_junction = Table(table_name,metadata,
                            Column('json_key', Integer, ForeignKey('Talent.json_key')),
                            Column('strength_id', Integer, ForeignKey('Strengths.strength_id'))
                            )

    table_name = 'Weaknesses_Junction'
    weaknesses_junction = Table(table_name,metadata,
                            Column('json_key', Integer, ForeignKey('Talent.json_key')),
                            Column('weakness_id', Integer)
                            )

    table_name = 'Tech_Self_Scores'
    tech_table = Table(table_name, metadata,
                    Column('tech_id', Integer, primary_key=True, autoincrement=True),
                    Column('tech_name', String(50), unique=True, nullable=False)
                    )

    table_name = 'Tech_Junction'
    tech_junction_table = Table(table_name, metadata,
                                Column('tech_id', Integer, ForeignKey("Tech_Self_Scores")),
                                Column('json_key', Integer, ForeignKey('Talent.json_key')),
                                Column('score', Integer, nullable=False)
                                )

    table_name = 'Trainers'
    trainers_table = Table(table_name, metadata,
                            Column('trainer_id', String(30), primary_key=True),
                            Column('trainer', String(50), nullable=False, unique=True)
                            )

    table_name = 'Courses'
    courses_table = Table(table_name, metadata,
                        Column('course_id', String(30), primary_key=True),
                        Column('course_name', String, nullable=False)
                        )

    table_name = 'Spartans'
    spartans_table = Table(table_name, metadata,
                        Column('spartan_id', Integer, primary_key=True,autoincrement=True),
                        Column('json_key', Integer, ForeignKey('Talent.json_key'), unique=True, nullable=True),
                        Column('trainer_id', String(30), ForeignKey('Trainers.trainer_id'), nullable=False),
                        Column('course_id', String(30), ForeignKey('Courses.course_id'), nullable=False)
                        )

    table_name = 'Behaviours'
    behaviours_table = Table(table_name, metadata, 
                            Column('behaviour_id', Integer, primary_key=True, autoincrement=True), 
                            Column('spartan_id', Integer, ForeignKey('Spartans.spartan_id')), 
                            Column('week_number', Integer, nullable=False), 
                            Column('analytic', Integer), 
                            Column('independent', Integer), 
                            Column('imaginative', Integer), 
                            Column('studious', Integer), 
                            Column('professional', Integer), 
                            Column('determined', Integer)
                            )

    metadata.create_all(engine)

In [4]:
import importlib
import TalentTable
importlib.reload(TalentTable)
import Applicant_cleaning
importlib.reload(Applicant_cleaning)

In [5]:
import importlib
import json_strengths_weaknesses
importlib.reload(json_strengths_weaknesses)
import Technologies
importlib.reload(Technologies)

In [8]:
df_temp = json_strengths_weaknesses.pull_json_from_s3('data-eng-210-final-project', 'Talent')
df_strengths, df_strengths_junction = json_strengths_weaknesses.generate_strengths(df_temp)
df_weaknesses, df_weaknesses_junction = json_strengths_weaknesses.generate_weaknesses(df_temp)

  json_key   weaknesses
0    10383   Distracted
1    10383    Impulsive
2    10383  Introverted
3    10384  Overbearing
4    10384       Chatty

In [161]:
df_tech_self_scores, df_tech_junction = Technologies.technologies()

In [ ]:
df_talent, df_academy_locations = TalentTable.Talent()
df_talent['geo_flex'] = df_talent['geo_flex'].map({'Yes': True, 'No':False})
df_talent['financial_support_self'] = df_talent['financial_support_self'].map({'Yes': True, 'No':False})
df_talent['self_development'] = df_talent['self_development'].map({'Yes': True, 'No':False})
df_talent['result'] = df_talent['result'].map({'Pass': 1, 'Fail':0})

In [ ]:
# Caching talent tables because they take ages, dont use normally
with open('df_strengths.csv', 'w') as file:
    df_strengths.to_csv(file)
with open('df_weaknesses.csv', 'w') as file:
    df_weaknesses.to_csv(file)
with open('df_strengths_junction.csv', 'w') as file:
    df_strengths_junction.to_csv(file)
with open('df_weaknesses_junction.csv', 'w') as file:
    df_weaknesses_junction.to_csv(file)
with open('df_talent.csv', 'w') as file:
    df_talent.to_csv(file)
with open('df_academy_locations.csv', 'w') as file:
    df_academy_locations.to_csv(file)
with open('df_tech_self_scores.csv', 'w') as file:
    df_tech_self_scores.to_csv(file)
with open('df_tech_junction.csv', 'w') as file:
    df_tech_junction.to_csv(file)

In [9]:
#load from cached csvs, careful with losing data types
df_strengths = pd.read_csv('df_strengths.csv',index_col=0)
df_strengths_junction = pd.read_csv('df_strengths_junction.csv',index_col=0)
df_weaknesses = pd.read_csv('df_weaknesses.csv',index_col=0)
df_weaknesses_junction = pd.read_csv('df_weaknesses_junction.csv',index_col=0)
df_tech_self_scores = pd.read_csv('df_tech_self_scores.csv',index_col=0)
df_tech_junction = pd.read_csv('df_tech_junction.csv',index_col=0)
df_talent = pd.read_csv('df_talent.csv',index_col=0)
df_academy_locations = pd.read_csv('df_academy_locations.csv',index_col=0)
df_talent = df_talent.rename(columns={'Date':'date'})
df_talent.date = pd.to_datetime(df_talent.date)
df_talent_test = df_talent = pd.read_csv('df_talent.csv',index_col=0)
df_academy_locations = pd.read_csv('df_academy_locations.csv',index_col=0)

In [11]:
df_applicants, df_location, df_recruiters = Applicant_cleaning.process_locations()

In [12]:
#There's multiple jsons of the same person on the same date - this condenses them down and merges information
#(e.g. some duplicates have some of the sparta day scores some don't, this fixes that mostly)
df_talent = df_talent.groupby(['applicant_id'], as_index=False).first()

In [ ]:
#Debugging duplicate names
#df_talent[df_talent.duplicated(subset=['name'],keep=False)].sort_values("name")

In [85]:
#Debugging duplicate ids
#df_talent[df_talent.duplicated(subset=['applicant_id'],keep=False)].sort_values("applicant_id")

Empty DataFrame
Columns: [applicant_id, json_key, name, date, self_development, financial_support_self, result, course_interest, psychometric_result, presentation_result, geo_flex, academy_location_id]
Index: []

In [63]:
df_talent.drop_duplicates(subset=['applicant_id','course_interest','psychometric_result','presentation_result'])

,applicant_id,json_key,name,date,self_development,financial_support_self,result,course_interest,psychometric_result,presentation_result,geo_flex,academy_location_id
0,aarikapreist20190508,12361.0,Aarika Preist,2019-05-08,NaN,NaN,NaN,Engineering,57.0,16.0,NaN,2
1,abbeballard20190221,11619.0,Abbe Ballard,2019-02-21,NaN,NaN,NaN,Data,60.0,20.0,NaN,1
2,abbehanny20190326,11982.0,Abbe Hanny,2019-03-26,NaN,NaN,NaN,Data,60.0,23.0,NaN,2
3,abbieclifton20190122,11770.0,Abbie Clifton,2019-01-22,NaN,NaN,NaN,Engineering,61.0,23.0,NaN,2
4,abbimulvihill20191106,NaN,None,2019-11-06,NaN,NaN,NaN,None,48.0,17.0,NaN,2
...,...,...,...,...,...,...,...,...,...,...,...,...
4429,zondababbidge20190307,12136.0,Zonda Babbidge,2019-03-07,NaN,NaN,NaN,Business,58.0,19.0,NaN,1
4430,zondrafippe20190917,13113.0,Zondra Fippe,2019-09-17,NaN,NaN,NaN,Business,60.0,15.0,NaN,2
4431,zondralindgren20191016,NaN,None,2019-10-16,NaN,NaN,NaN,None,48.0,19.0,NaN,2
4432,zorahgrasser20190919,12975.0,Zorah Grasser,2019-09-19,NaN,NaN,NaN,Engineering,56.0,26.0,NaN,1
4433,zsazsarounsefull20190716,10705.0,Zsa Zsa Rounsefull,2019-07-16,NaN,NaN,NaN,Data,61.0,20.0,NaN,2

In [15]:
df_talent.date = pd.to_datetime(df_talent.date)
df_talent.dtypes

applicant_id                      object
json_key                         float64
name                              object
date                      datetime64[ns]
self_development                 float64
financial_support_self           float64
result                           float64
course_interest                   object
psychometric_result              float64
presentation_result              float64
geo_flex                         float64
academy_location_id                int64
dtype: object

In [16]:
#Method to add the applicant ID from Applicants to Talents by matching nearest data
def addApplicantIDToTalent(applicant_record):
     if(pd.isnull(applicant_record['invited_date'])):
          return
     result = df_talent[(df_talent['name'].str.lower() == applicant_record['name'].lower()) & ((df_talent['date'].isnull()) | (df_talent['date'] >= applicant_record['invited_date']))].sort_values(by='date',axis=0,ascending=True)
     if (applicant_record['name'].lower() == "fidel norval"):
          print(applicant_record)
          print(result)
     if not result.empty:
          df_talent.at[result.index[0],'applicant_id'] = applicant_record['applicant_id']
          #print(talent_record['json_key'])
          #print(result.index[0])df_talent
#Do for every row in Applicant
for index, row in df_applicants.iterrows():
    addApplicantIDToTalent(row)

name                                                Fidel Norval
gender                                                      Male
dob                                          1996-11-16 00:00:00
email                                       fnorval3a@ebay.co.uk
phone_number                                    +44-725-693-5614
uni             Courtauld Institute of Art, University of London
degree                                                       2:2
invited_date                                 2019-06-19 00:00:00
iddate                                                  20190619
applicant_id                                 fidelnorval20190619
recruiter_id                                                   8
Name: 118, dtype: object
             applicant_id  json_key          name date  self_development
1579  fidelnorval20190719   11082.0  Fidel Norval  NaT               NaN  \

      financial_support_self  result course_interest  psychometric_result
1579                     NaN     NaN     Engineering                  NaN  \

      presentation_result  geo_flex  academy_location_id
1579                  NaN       NaN                    0

In [94]:
df_talent[df_talent.duplicated(subset=['json_key'],keep=False)]

,applicant_id,json_key,name,date,self_development,financial_support_self,result,course_interest,psychometric_result,presentation_result,geo_flex,academy_location_id
4,abbimulvihill20191106,NaN,None,2019-11-06,NaN,NaN,NaN,None,48.0,17.0,NaN,2
9,abdulnail20190917,NaN,None,2019-09-17,NaN,NaN,NaN,None,52.0,12.0,NaN,2
13,abeuknightsbridge20190703,NaN,None,2019-07-03,NaN,NaN,NaN,None,65.0,13.0,NaN,2
17,abnerdevo20191024,NaN,None,2019-10-24,NaN,NaN,NaN,None,36.0,22.0,NaN,1
19,abrahanbiggerdike20191030,NaN,None,2019-10-30,NaN,NaN,NaN,None,48.0,14.0,NaN,2
...,...,...,...,...,...,...,...,...,...,...,...,...
4106,yumadowry20190502,NaN,None,2019-05-02,NaN,NaN,NaN,None,48.0,19.0,NaN,1
4108,yvettehammerberg20190226,NaN,None,2019-02-26,NaN,NaN,NaN,None,49.0,18.0,NaN,2
4121,zebadiahrollins20190926,NaN,None,2019-09-26,NaN,NaN,NaN,None,58.0,12.0,NaN,1
4123,zechariahsalzberger20190117,NaN,None,2019-01-17,NaN,NaN,NaN,None,47.0,19.0,NaN,1
4131,zondralindgren20191016,NaN,None,2019-10-16,NaN,NaN,NaN,None,48.0,19.0,NaN,2

In [17]:
import importlib
import academy_behaviours
importlib.reload(academy_behaviours)

                  Null Values Count  Null Values Percentage
name                              0                0.000000
trainer                           0                0.000000
Analytic_W1                       0                0.000000
Independent_W1                    0                0.000000
Determined_W1                     0                0.000000
...                             ...                     ...
Independent_W10                 235               59.193955
Determined_W10                  235               59.193955
Professional_W10                235               59.193955
Studious_W10                    235               59.193955
Imaginative_W10                 235               59.193955

[64 rows x 2 columns]
Duplicate names: []
['analytic_w1', 'independent_w1', 'determined_w1', 'professional_w1', 'studious_w1', 'imaginative_w1', 'analytic_w2', 'independent_w2', 'determined_w2', 'professional_w2', 'studious_w2', 'imaginative_w2', 'analytic_w3', 'independent_w3', 'determined_w3', 'professional_w3', 'studious_w3', 'imaginative_w3', 'analytic_w4', 'independent_w4', 'determined_w4', 'professional_w4', 'studious_w4', 'imaginative_w4', 'analytic_w5', 'independent_w5', 'determined_w5', 'professional_w5', 'studious_w5', 'imaginative_w5', 'analytic_w6', 'independent_w6', 'determined_w6', 'professional_w6', 'studious_w6', 'imaginative_w6', 'analytic_w7', 'independent_w7', 'determined_w7', 'professional_w7', 'studious_w7', 'imaginative_w7', 'analytic_w8', 'independent_w8', 'determined_w8', 'professional_w8', 'studious_w8', 'imaginative_w8', 'analytic_w9', 'independent_w9', 'determined_w9', 'professional_w9', 'studious_w9', 'imaginative_w9', 'analytic_w10', 'independent_w10', 'determined_w10', 'professional_w10', 'studious_w10', 'imaginative_w10']
    analytic_w1 independent_w1 determined_w1 professional_w1 studious_w1
0             1              2             2               1           2  \
1             6              1             1               2           4
2             6              4             1               1           2
3             2              1             2               3           3
4             2              2             4               5           1
..          ...            ...           ...             ...         ...
392           1              1             5               1           2
393           1              3             3               4           1
394           3              1             2               8           1
395           3              7             3               3           3
396           4              2             5               1           1

    imaginative_w1 analytic_w2 independent_w2 determined_w2 professional_w2
0                2         nan            nan           nan             nan  \
1                2         3.0            1.0           3.0             2.0
2                3         1.0            1.0           1.0             2.0
3                3         4.0            2.0           1.0             3.0
4                2         3.0            2.0           5.0             3.0
..             ...         ...            ...           ...             ...
392              6         5.0            3.0           3.0             3.0
393              2         3.0            3.0           5.0             5.0
394              4         2.0            4.0           3.0             1.0
395              1         2.0            7.0           2.0             3.0
396              2         4.0            1.0           1.0             3.0

    studious_w2 imaginative_w2 analytic_w3 independent_w3 determined_w3
0           nan            nan         nan            nan           nan  \
1           1.0            1.0         nan            nan           nan
2           1.0            6.0         6.0            2.0           2.0
3           3.0            7.0         3.0            5.0           3.0
4           1.0            1.0         3.0            2.0           3.0
..          ...            ...         ...            ...           ...
392         2.0            2.0         3.0            2.0           2.0
393         7.0            1.0         5.0            5.0           1.0
394         3.0            1.0         6.0            2.0           1.0
395         4.0            1.0         1.0            3.0           1.0
396         2.0            5.0         3.0            4.0           1.0

    professional_w3 studious_w3 imaginative_w3 analytic_w4 independent_w4
0               nan         nan            nan         nan            nan  \
1               nan         nan            nan         nan            nan
2               3.0         3.0            2.0         5.0            1.0
3               1.0         3.0            3.0         2.0            8.0
4               4.0         4.0            2.0         8.0            6.0
..              ...         ...            ...         ...            ...
392             3.0         6.0            1.0         8.0            6.0
393             1.0         3.0            3.0         7.0            6.0
394             2.0         3.0            8.0         6.0            8.0
395             2.0         6.0            5.0         4.0            4.0
396             5.0         5.0            3.0         8.0            6.0

    determined_w4 professional_w4 studious_w4 imaginative_w4 analytic_w5
0             nan             nan         nan            nan         nan  \
1             nan             nan         nan            nan         nan
2             3.0             7.0         6.0            2.0         6.0
3             1.0             8.0         5.0            5.0         2.0
4             8.0             2.0         4.0            8.0         6.0
..            ...             ...         ...            ...         ...
392           8.0             5.0         5.0            3.0         6.0
393           5.0             7.0         8.0            8.0         2.0
394           3.0             5.0         8.0            5.0         8.0
395           5.0             3.0         6.0            8.0         4.0
396           5.0             8.0         3.0            8.0         5.0

    independent_w5 determined_w5 professional_w5 studious_w5 imaginative_w5
0              nan           nan             nan         nan            nan  \
1              nan           nan             nan         nan            nan
2              8.0           4.0             8.0         1.0            8.0
3              1.0           8.0             5.0         6.0            5.0
4              2.0           8.0             8.0         8.0            5.0
..             ...           ...             ...         ...            ...
392            8.0           7.0             7.0         4.0            2.0
393            6.0           6.0             8.0         8.0            4.0
394            4.0           6.0             2.0         3.0            2.0
395            3.0           8.0             3.0         8.0            5.0
396            5.0           5.0             7.0         5.0            4.0

    analytic_w6 independent_w6 determined_w6 professional_w6 studious_w6
0           nan            nan           nan             nan         nan  \
1           nan            nan           nan             nan         nan
2           7.0            3.0           5.0             8.0         8.0
3           7.0            6.0           5.0             7.0         8.0
4           7.0            5.0           5.0             5.0         5.0
..          ...            ...           ...             ...         ...
392         7.0            4.0           5.0             7.0         7.0
393         2.0            5.0           4.0             8.0         4.0
394         6.0            8.0           6.0             8.0         7.0
395         5.0            3.0           5.0             6.0         7.0
396         1.0            5.0           4.0             8.0         6.0

    imaginative_w6 analytic_w7 independent_w7 determined_w7 professional_w7
0              nan         nan            nan           nan             nan  \
1              nan         nan            nan           nan             nan
2              7.0         8.0            5.0           8.0             8.0
3              2.0         8.0            6.0           8.0             7.0
4              8.0         8.0            7.0           7.0             8.0
..             ...         ...            ...           ...             ...
392            7.0         6.0            8.0           8.0             7.0
393            6.0         6.0            6.0           8.0             8.0
394            8.0         8.0            3.0           8.0             8.0
395            7.0         8.0            8.0           8.0             8.0
396            8.0         8.0            6.0           8.0             8.0

    studious_w7 imaginative_w7 analytic_w8 independent_w8 determined_w8
0           nan            nan         nan            nan           nan  \
1           nan            nan         nan            nan           nan
2           8.0            6.0         8.0            7.0           8.0
3           8.0            8.0         8.0            8.0           7.0
4           8.0            8.0         8.0            7.0           8.0
..          ...            ...         ...            ...           ...
392         8.0            5.0         4.0            8.0           7.0
393         8.0            8.0         7.0            8.0           5.0
394         4.0            8.0         8.0            8.0           8.0
395         8.0            8.0         8.0            4.0           6.0
396         6.0            8.0         8.0            8.0           8.0

    professional_w8 studious_w8 imaginative_w8 analytic_w9 independent_w9
0               nan         nan            nan         nan            nan  \
1               nan         nan            nan         nan            nan
2               8.0         7.0            8.0         nan            nan
3               8.0         7.0            5.0         nan            nan
4               8.0         8.0            8.0         nan            nan
..              ...         ...            ...         ...            ...
392             8.0         8.0            8.0         nan            nan
393             8.0         8.0            8.0         nan            nan
394             8.0         8.0            5.0         nan            nan
395             8.0         8.0            8.0         nan            nan
396             6.0         6.0            8.0         nan            nan

    determined_w9 professional_w9 studious_w9 imaginative_w9 analytic_w10
0             nan             nan         nan            nan          nan  \
1             nan             nan         nan            nan          nan
2             nan             nan         nan            nan          nan
3             nan             nan         nan            nan          nan
4             nan             nan         nan            nan          nan
..            ...             ...         ...            ...          ...
392           nan             nan         nan            nan          nan
393           nan             nan         nan            nan          nan
394           nan             nan         nan            nan          nan
395           nan             nan         nan            nan          nan
396           nan             nan         nan            nan          nan

    independent_w10 determined_w10 professional_w10 studious_w10
0               nan            nan              nan          nan  \
1               nan            nan              nan          nan
2               nan            nan              nan          nan
3               nan            nan              nan          nan
4               nan            nan              nan          nan
..              ...            ...              ...          ...
392             nan            nan              nan          nan
393             nan            nan              nan          nan
394             nan            nan              nan          nan
395             nan            nan              nan          nan
396             nan            nan              nan          nan

    imaginative_w10
0               nan
1               nan
2               nan
3               nan
4               nan
..              ...
392             nan
393             nan
394             nan
395             nan
396             nan

[397 rows x 60 columns]
                  Null Values Count  Null Values Percentage
name                              0                0.000000
trainer                           0                0.000000
Analytic_W1                       0                0.000000
Independent_W1                    0                0.000000
Determined_W1                     0                0.000000
...                             ...                     ...
Independent_W10                 235               59.193955
Determined_W10                  235               59.193955
Professional_W10                235               59.193955
Studious_W10                    235               59.193955
Imaginative_W10                 235               59.193955

[64 rows x 2 columns]
Duplicate names: []
['analytic_w1', 'independent_w1', 'determined_w1', 'professional_w1', 'studious_w1', 'imaginative_w1', 'analytic_w2', 'independent_w2', 'determined_w2', 'professional_w2', 'studious_w2', 'imaginative_w2', 'analytic_w3', 'independent_w3', 'determined_w3', 'professional_w3', 'studious_w3', 'imaginative_w3', 'analytic_w4', 'independent_w4', 'determined_w4', 'professional_w4', 'studious_w4', 'imaginative_w4', 'analytic_w5', 'independent_w5', 'determined_w5', 'professional_w5', 'studious_w5', 'imaginative_w5', 'analytic_w6', 'independent_w6', 'determined_w6', 'professional_w6', 'studious_w6', 'imaginative_w6', 'analytic_w7', 'independent_w7', 'determined_w7', 'professional_w7', 'studious_w7', 'imaginative_w7', 'analytic_w8', 'independent_w8', 'determined_w8', 'professional_w8', 'studious_w8', 'imaginative_w8', 'analytic_w9', 'independent_w9', 'determined_w9', 'professional_w9', 'studious_w9', 'imaginative_w9', 'analytic_w10', 'independent_w10', 'determined_w10', 'professional_w10', 'studious_w10', 'imaginative_w10']
    analytic_w1 independent_w1 determined_w1 professional_w1 studious_w1
0             1              2             2               1           2  \
1             6              1             1               2           4
2             6              4             1               1           2
3             2              1             2               3           3
4             2              2             4               5           1
..          ...            ...           ...             ...         ...
392           1              1             5               1           2
393           1              3             3               4           1
394           3              1             2               8           1
395           3              7             3               3           3
396           4              2             5               1           1

    imaginative_w1 analytic_w2 independent_w2 determined_w2 professional_w2
0                2         nan            nan           nan             nan  \
1                2         3.0            1.0           3.0             2.0
2                3         1.0            1.0           1.0             2.0
3                3         4.0            2.0           1.0             3.0
4                2         3.0            2.0           5.0             3.0
..             ...         ...            ...           ...             ...
392              6         5.0            3.0           3.0             3.0
393              2         3.0            3.0           5.0             5.0
394              4         2.0            4.0           3.0             1.0
395              1         2.0            7.0           2.0             3.0
396              2         4.0            1.0           1.0             3.0

    studious_w2 imaginative_w2 analytic_w3 independent_w3 determined_w3
0           nan            nan         nan            nan           nan  \
1           1.0            1.0         nan            nan           nan
2           1.0            6.0         6.0            2.0           2.0
3           3.0            7.0         3.0            5.0           3.0
4           1.0            1.0         3.0            2.0           3.0
..          ...            ...         ...            ...           ...
392         2.0            2.0         3.0            2.0           2.0
393         7.0            1.0         5.0            5.0           1.0
394         3.0            1.0         6.0            2.0           1.0
395         4.0            1.0         1.0            3.0           1.0
396         2.0            5.0         3.0            4.0           1.0

    professional_w3 studious_w3 imaginative_w3 analytic_w4 independent_w4
0               nan         nan            nan         nan            nan  \
1               nan         nan            nan         nan            nan
2               3.0         3.0            2.0         5.0            1.0
3               1.0         3.0            3.0         2.0            8.0
4               4.0         4.0            2.0         8.0            6.0
..              ...         ...            ...         ...            ...
392             3.0         6.0            1.0         8.0            6.0
393             1.0         3.0            3.0         7.0            6.0
394             2.0         3.0            8.0         6.0            8.0
395             2.0         6.0            5.0         4.0            4.0
396             5.0         5.0            3.0         8.0            6.0

    determined_w4 professional_w4 studious_w4 imaginative_w4 analytic_w5
0             nan             nan         nan            nan         nan  \
1             nan             nan         nan            nan         nan
2             3.0             7.0         6.0            2.0         6.0
3             1.0             8.0         5.0            5.0         2.0
4             8.0             2.0         4.0            8.0         6.0
..            ...             ...         ...            ...         ...
392           8.0             5.0         5.0            3.0         6.0
393           5.0             7.0         8.0            8.0         2.0
394           3.0             5.0         8.0            5.0         8.0
395           5.0             3.0         6.0            8.0         4.0
396           5.0             8.0         3.0            8.0         5.0

    independent_w5 determined_w5 professional_w5 studious_w5 imaginative_w5
0              nan           nan             nan         nan            nan  \
1              nan           nan             nan         nan            nan
2              8.0           4.0             8.0         1.0            8.0
3              1.0           8.0             5.0         6.0            5.0
4              2.0           8.0             8.0         8.0            5.0
..             ...           ...             ...         ...            ...
392            8.0           7.0             7.0         4.0            2.0
393            6.0           6.0             8.0         8.0            4.0
394            4.0           6.0             2.0         3.0            2.0
395            3.0           8.0             3.0         8.0            5.0
396            5.0           5.0             7.0         5.0            4.0

    analytic_w6 independent_w6 determined_w6 professional_w6 studious_w6
0           nan            nan           nan             nan         nan  \

In [18]:
df_courses = academy_behaviours.course.copy()
df_courses = df_courses.drop_duplicates().reset_index(drop=True)
df_trainers = academy_behaviours.trainer.copy()
df_trainers = df_trainers.drop_duplicates().reset_index(drop=True)
df_spartans = academy_behaviours.spartans.copy()

In [19]:
df_spartans[~df_spartans['name'].isin(df_talent.dropna(subset='json_key',axis=0)['name'])]

Empty DataFrame
Columns: [behaviour_id, name, date, trainer_id, course_id]
Index: []

In [20]:
#Need course names to match people and link to talent
df_spartans['course_name'] = df_spartans['course_id'].replace(df_courses.course_id.tolist(),df_courses.course_name.tolist())

In [21]:
df_behaviours = academy_behaviours.behaviour.copy()

In [22]:
#Method to add the applicant ID from Talents to Spartans by matching nearest course
def addApplicantID(talent_record):
     # if talent_record['date'].isna():
     #      return
     result = df_spartans[(df_spartans['name'] == talent_record['name']) & (df_spartans['course_name'] == talent_record['course_interest']) &
                ((df_spartans['date'] >= talent_record['date']) | (pd.isnull(talent_record['date'])))].sort_values(by='date',axis=0,ascending=True)
     if not result.empty:
          df_spartans.at[result.index[0],'json_key'] = talent_record['json_key']
          #print(talent_record['json_key'])
          #print(result.index[0])
#Do for every row in talent
for index, row in df_talent.iterrows():
    addApplicantID(row)

In [23]:
df_spartans.json_key.isna().sum()

0

In [53]:
with engine.connect() as conn:
    result = pd.read_sql(text("SELECT * FROM Courses"),conn)
    print(result.columns)
    display(result)

Index(['course_id', 'course_name'], dtype='object')

  course_id  course_name
0       BUS     Business
1       DAT         Data
2       ENG  Engineering

In [ ]:
print(len(df_talent),len(df_applicants))

In [27]:
df_talent = df_talent.groupby(['applicant_id'], as_index=False).first()
df_talent[df_talent.duplicated(subset="applicant_id",keep=False)]

Empty DataFrame
Columns: [applicant_id, json_key, name, date, self_development, financial_support_self, result, course_interest, psychometric_result, presentation_result, geo_flex, academy_location_id]
Index: []

In [28]:
df_applicants[~df_applicants['applicant_id'].isin(df_talent['applicant_id'])]

,name,gender,dob,email,phone_number,uni,degree,invited_date,iddate,applicant_id,recruiter_id
3,Eryn Speers,Female,NaT,espeers3@shinystat.com,+44-148-787-0613,University of Edinburgh,2:1,NaT,20190400,erynspeers20190400,4
11,Carlen Kemell,Female,1997-03-30,ckemellb@theglobeandmail.com,NaN,"University of Halifax, Birmingham Campus",2:1,NaT,20190400,carlenkemell20190400,4
26,Kristien Down,Female,1998-09-11,NaN,+44-515-630-5818,The Queen's University Belfast,2:1,NaT,20190400,kristiendown20190400,4
30,Zoe Silver,Female,1993-04-07,zsilveru@artisteer.com,+44-563-661-1984,University of Liverpool,2:1,NaT,20190400,zoesilver20190400,4
32,Stuart Birnie,Male,1998-09-09,NaN,NaN,University of Plymouth,2:2,NaT,20190400,stuartbirnie20190400,4
...,...,...,...,...,...,...,...,...,...,...,...
348,Quincey Matuszyk,Male,1999-03-03,qmatuszyk9o@ebay.co.uk,+44-121-796-8376,Leeds Metropolitan University,3rd,NaT,20190900,quinceymatuszyk20190900,4
374,Winni Bason,Female,1990-04-10,wbasonae@answers.com,NaN,University of Birmingham,2:2,NaT,20190900,winnibason20190900,4
383,Ninetta Garling,Female,1990-09-29,NaN,+44-958-122-8728,Leeds Metropolitan University,2:1,NaT,20190900,ninettagarling20190900,4
401,Hastings Fincher,Male,1995-01-22,hfincherb5@weebly.com,+44-348-361-7341,"Institute of Education, University of London",2:2,NaT,20190900,hastingsfincher20190900,4
409,Claudia Feldhuhn,Female,1997-05-14,cfeldhuhnbd@psu.edu,+44-770-742-9595,University of Ulster,2:1,NaT,20190900,claudiafeldhuhn20190900,4

In [29]:
# Insert Recruiters table - NO DEPENDENCIES
with engine.connect() as conn:
    conn.execute(text("SET IDENTITY_INSERT Recruiters ON"))
    result = df_recruiters.to_sql('Recruiters',conn,if_exists='append',index=False)
    conn.execute(text("SET IDENTITY_INSERT Recruiters OFF"))
    conn.commit()

In [30]:
# Insert Applicants table - DEPENDS ON Recruiters
with engine.connect() as conn:
    #conn.execute(text("SET IDENTITY_INSERT Applicants ON"))
    result = df_applicants.drop(["iddate"],axis=1).to_sql('Applicants',conn,if_exists='append',index=False)
    #conn.execute(text("SET IDENTITY_INSERT Applicants OFF"))
    conn.commit()

In [31]:
# Insert Academy_Locations table - NO DEPENDENCIES
with engine.connect() as conn:
    conn.execute(text("SET IDENTITY_INSERT Strengths OFF"))
    conn.execute(text("SET IDENTITY_INSERT Academy_Locations ON"))
    result = df_academy_locations.to_sql('Academy_Locations',conn,if_exists='append',index=False)
    conn.execute(text("SET IDENTITY_INSERT Academy_Locations OFF"))
    conn.commit()

In [32]:
# Insert Talent table - DEPENDS ON Academy_Locations AND Applicants
# import numpy as np

with engine.connect() as conn:
    # conn.execute(text("SET IDENTITY_INSERT Talent ON"))
    result = df_talent.drop(['name'], axis=1).dropna(subset="json_key",axis=0).to_sql('Talent',conn,if_exists='append',index=False)
    # conn.execute(text("SET IDENTITY_INSERT Talent OFF"))
    conn.commit()

In [33]:
df_strengths_junction[~df_strengths_junction['strength_id'].isin(df_strengths['strength_id'])]

Empty DataFrame
Columns: [json_key, strength_id]
Index: []

In [34]:
# Insert Strengths table - NO DEPENDENCIES
with engine.connect() as conn:
    conn.execute(text("SET IDENTITY_INSERT Strengths ON"))
    result = df_strengths.to_sql('Strengths',conn,if_exists='append',index=False)
    conn.execute(text("SET IDENTITY_INSERT Strengths OFF"))
    conn.commit()

In [35]:
# Insert Weaknesses table - NO DEPENDENCIES
with engine.connect() as conn:
    conn.execute(text("SET IDENTITY_INSERT Strengths OFF"))
    conn.execute(text("SET IDENTITY_INSERT Weaknesses ON"))
    result = df_weaknesses.to_sql('Weaknesses',conn,if_exists='append',index=False)
    conn.execute(text("SET IDENTITY_INSERT Weaknesses OFF"))
    conn.commit()

In [36]:
# Insert Tech_Self_Scores table - NO DEPENDENCIES
with engine.connect() as conn:
    conn.execute(text("SET IDENTITY_INSERT Tech_Self_Scores ON"))
    result = df_tech_self_scores.to_sql('Tech_Self_Scores',conn,if_exists='append',index=False)
    conn.execute(text("SET IDENTITY_INSERT Tech_Self_Scores OFF"))
    conn.commit()

In [37]:
# Have to eliminate leftover duplicates from people with repeated .jsons - this doesnt actually lose any data
df_strengths_junction = df_strengths_junction.drop(index = df_strengths_junction[~df_strengths_junction['json_key'].isin(df_talent['json_key'])].index)
df_weaknesses_junction = df_weaknesses_junction.drop(index = df_weaknesses_junction[~df_weaknesses_junction['json_key'].isin(df_talent['json_key'])].index)
df_tech_junction = df_tech_junction.drop(index=df_tech_junction[~df_tech_junction['json_key'].astype('float').isin(df_talent['json_key'])].index)

In [38]:
df_strengths_junction[~df_strengths_junction['json_key'].isin(df_talent['json_key'])]

Empty DataFrame
Columns: [json_key, strength_id]
Index: []

In [39]:
# Insert Strengths_Junction table - DEPENDS ON Strengths_Junction AND Talent
with engine.connect() as conn:
    # conn.execute(text("SET IDENTITY_INSERT Weaknesses_junction ON"))
    result = df_strengths_junction.to_sql('Strengths_Junction',conn,if_exists='append',index=False)
    # conn.execute(text("SET IDENTITY_INSERT Weaknesses_junction OFF"))
    conn.commit()

In [40]:
# Insert Weaknesses_Junction table - DEPENDS ON Weaknesses AND Talent
with engine.connect() as conn:
    # conn.execute(text("SET IDENTITY_INSERT Weaknesses_junction ON"))
    result = df_weaknesses_junction.to_sql('Weaknesses_Junction',conn,if_exists='append',index=False)
    # conn.execute(text("SET IDENTITY_INSERT Weaknesses_junction OFF"))
    conn.commit()

In [41]:
# Insert Tech_Junction table - DEPENDS ON Weaknesses AND Talent
with engine.connect() as conn:
    # conn.execute(text("SET IDENTITY_INSERT Tech_Junction ON"))
    result = df_tech_junction.to_sql('Tech_Junction',conn,if_exists='append',index=False)
    # conn.execute(text("SET IDENTITY_INSERT Tech_Junction OFF"))
    conn.commit()

In [ ]:
# Insert Location table - DEPENDS ON Applicants
with engine.connect() as conn:
    conn.execute(text("SET IDENTITY_INSERT Location ON"))
    result = df_location.to_sql('Location',conn,if_exists='append',index=False)
    conn.execute(text("SET IDENTITY_INSERT Location OFF"))
    conn.commit()

In [ ]:
#df_talent = df_talent.drop(index = df_talent[~df_talent['applicant_id'].isin(df_applicants['applicant_id'])].index)

In [43]:
# Insert Courses table - NO DEPENDENCIES
with engine.connect() as conn:
    #conn.execute(text("SET IDENTITY_INSERT Courses ON"))
    result = df_courses.to_sql('Courses',conn,if_exists='append',index=False)
    #conn.execute(text("SET IDENTITY_INSERT Courses OFF"))
    conn.commit()

In [44]:
# Insert Trainers table - NO DEPENDENCIES
with engine.connect() as conn:
    #conn.execute(text("SET IDENTITY_INSERT Trainers ON"))
    df_trainers.to_sql('Trainers',conn,if_exists='append',index=False)
    #conn.execute(text("SET IDENTITY_INSERT Trainers OFF"))
    conn.commit()

In [45]:
#Somehow theres records with a json_key but not the details that go with it?
#This was "fixed" in the linking method by linking by name only if date is missing
df_spartans[df_spartans.json_key.duplicated(keep=False)]

Empty DataFrame
Columns: [behaviour_id, name, date, trainer_id, course_id, course_name, json_key]
Index: []

In [46]:
# Insert Spartans table - DEPENDS ON Courses AND Tables
with engine.connect() as conn:
    df_spartans.drop(['behaviour_id','name','course_name','date'],axis=1).to_sql('Spartans',conn,if_exists='append',index=False)

In [47]:
#Need to query database for auto-generated spartan ids, merge behaviours so that we can extract the sparta_id into behaviour records
with engine.connect() as conn:
    df_spartans_temp = pd.read_sql(text("SELECT * FROM Spartans"), conn)
    df_behaviours_insert = pd.merge(df_behaviours, pd.merge(df_spartans, df_spartans_temp, on='json_key')[
        ['behaviour_id', 'spartan_id']], on='behaviour_id').drop(['behaviour_id', 'name'], axis=1).rename(columns={'week': 'week_number'})

In [48]:
# Insert Behaviours table - DEPENDS ON Spartans
with engine.connect() as conn:
    # conn.execute(text("SET IDENTITY_INSERT Behaviours ON"))
    df_behaviours_insert.to_sql('Behaviours', conn, if_exists='append', index=False)
    # conn.execute(text("SET IDENTITY_INSERT Behaviours OFF"))
    conn.commit()